rainer20512/stm32-fw/common/src/dev/usart.c
/**
  ******************************************************************************
  * @file    usart.c
  * @author  Rainer 
  * @brief   Initialize on of the STM32L4's U(S)ARTs as debug output, assign
  *          input and output buffers and start receive and transmit
  *
  * @note    Receive is done on a character by character basis by Interrupts
  *          Transmit is done blockwise by DMA
  *          The U(S)ARTs Receive line is also used as edge triggered EXTI
  *          interrupt to wakeup from Stop.
  * 
  ******************************************************************************
  *
  ******************************************************************************
  * @addtogroup USART
  * @{
  */
/* Includes ------------------------------------------------------------------*/

#include <string.h>

#include "config/config.h"
#include "error.h"
#include "dev/hw_device.h"
#include "system/hw_util.h"

#include "dev/uart_dev.h"
#include "dev/devices.h"
#include "config/uart_config.h"

#include "debug_helper.h"

/*******************************************************************************************
 * Additional data that will be stored to UART type hardware devices
 ******************************************************************************************/

typedef struct {
//    USART_TypeDef       *myUart;
    UsartHandleT        *myHandle;
    uint32_t            myBaudrate;
} USART_AdditionalDataType;

/* ------------------------------------------------------------------------------*/
/* Public device variables ------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/
/* UART declarations */

typedef enum UsartDmaDirectionEnum {
  USART_DMA_RX=0,                       // Rx DMA
  USART_DMA_TX,                         // Tx DMA
} UsartDmaDirectionEnumType;

/* ------------------------------------------------------------------------------*/
/* Forward declarations ---------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/
void UsartStopTx            (UsartHandleT *uhandle);
void UsartStopRx            (UsartHandleT *uhandle);

/* ------------------------------------------------------------------------------*/
/* Private functions ------------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/

static USART_AdditionalDataType * USART_GetAdditionalData(const HW_DeviceType *self)
{
    #if DEBUG_MODE > 0
        if ( self->devType != HW_DEVICE_UART )
            DEBUG_PUTS("Passed device is not an u(s)art!");
    #endif
    assert(self->devType == HW_DEVICE_UART);
    return (USART_AdditionalDataType *)(self->devData);
}

UsartHandleT * USART_GetHandleFromDev(const HW_DeviceType *self)
{
    return USART_GetAdditionalData(self)->myHandle;
}


#define TX_IDX  0
#define RX_IDX  1

static bool Usart_SetClockSource(const void *hw)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  PeriphClkInit.PeriphClockSelection = 0;
  switch ( (uint32_t)hw ) {
#if defined(USART1) && defined(USE_USART1)
    case USART1_BASE:
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART1; 
    PeriphClkInit.Usart1ClockSelection = USART1_CLKSOURCE;
    break;
#endif
#if defined(USART2) && defined(USE_USART2)
    case USART2_BASE:
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART2; 
    PeriphClkInit.Usart2ClockSelection = USART2_CLKSOURCE;
    break;
#endif
#if defined(USART3) && defined(USE_USART3)
    case USART3_BASE:    
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_USART3; 
    PeriphClkInit.Usart3ClockSelection = USART3_CLKSOURCE;
    break;
#endif
#if defined(UART4) && defined(USE_UART4)
    case UART4_BASE:
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART4; 
    PeriphClkInit.Uart4ClockSelection  = UART4_CLKSOURCE;
    break;
#endif
#if defined(UART5) && defined(USE_UART5)
    case UART5_BASE:
    PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_UART5; 
    PeriphClkInit.Uart5ClockSelection  = UART5_CLKSOURCE;
    break;
#endif
#if defined(LPUART1) && defined(USE_LPUART1)
    case LPUART1_BASE:
    PeriphClkInit.PeriphClockSelection  = RCC_PERIPHCLK_LPUART1; 
    PeriphClkInit.Lpuart1ClockSelection = LPUART1_CLKSOURCE;
    break;
#endif
    default:
        DEBUG_PRINTF("No Clock source set receipe for HW base 0x%08x\n", (uint32_t)hw );
        return false;
  } // switch

  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK) {
    DEBUG_PRINTF("failed to set source for HW base 0x%08x\n", (uint32_t)hw );
    return false;
  }

  return true;
}

/*
 * Init or DeInit Clock / clocksource 
 */
static bool Usart_Clock_Init(const HW_DeviceType *self, bool bDoInit)
{
    /* Select clock source on init*/
    if ( bDoInit ) {
        if ( !Usart_SetClockSource( self->devBase ) ) return false;
    }

    /* Enable/Disable clock */
    HW_SetHWClock( ( USART_TypeDef*)self->devBase, bDoInit );
    return true;
}

bool Usart_GPIO_Init(const HW_DeviceType *self)
{
    GPIO_InitTypeDef  GPIO_InitStruct;


    /*##-2- Configure Tx and Rx pins ##########################################*/  
    GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FREQ_LOW;

    GpioAFInitAll(self->devGpioAF, &GPIO_InitStruct);

    return true;
}


/******************************************************************************
 * Se the U(S)ARTs communication parameters
 * currently all comm parameters except baudrate are fixed!
 *****************************************************************************/
bool Usart_SetCommParams(UsartHandleT *myHandle, uint32_t baudrate, bool bFirstInit )
{
  UART_HandleTypeDef huart;
  USART_TypeDef *utiny  = myHandle->Instance;

  /* keep actual baudrate in mind ( need it if system frequancy changes */
  myHandle->baudrate = baudrate;

  /* Disable U(S)ART temporarily */
  utiny->CR1 &= ~USART_CR1_UE;

  /* Reset U(S)ARTs config on first init */
  if ( bFirstInit ) {
      utiny->CR1 = 0x0U;
      utiny->CR2 = 0x0U;
      utiny->CR3 = 0x0U;
  }

  huart.Instance            = utiny;
  huart.Init.BaudRate       = myHandle->baudrate;
  huart.Init.WordLength     = UART_WORDLENGTH_8B;
  huart.Init.StopBits       = UART_STOPBITS_1;
  huart.Init.Parity         = UART_PARITY_NONE;
  huart.Init.HwFlowCtl      = UART_HWCONTROL_NONE;
  huart.Init.Mode           = UART_MODE_TX_RX;
  huart.Init.OverSampling   = UART_OVERSAMPLING_16;
  huart.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;

  /* Set the UART Communication parameters */
  if (UART_SetConfig(&huart) == HAL_ERROR) {
      Error_Handler(__FILE__, __LINE__);
      return false;
  }

