rainer20512/stm32-fw/common/src/dev/usart.c
  /* Set Wakeup Flag selection to RXNE */
  utiny->CR3 |= (USART_CR3_WUS_0 | USART_CR3_WUS_1);

  /* If RX mode is not character mode, disable Receiver, must be enabled manually */
  if (!myHandle->bRxCharMode) CLEAR_BIT(utiny->CR1, USART_CR1_RE);

  /* Enable U(S)ART  */
  utiny->CR1 |= USART_CR1_UE;

  return true;
}
/******************************************************************************
 * Wrapper for "Usart_SetCommParams"
 * Thsi function will be called by device manager every time the system
 * frequency changes
 *****************************************************************************/
bool Usart_OnFrqChange( const HW_DeviceType *self )
{
    return Usart_SetCommParams(USART_GetAdditionalData(self)->myHandle, USART_GetAdditionalData(self)->myBaudrate, false );
}

/**
  * @brief DMA UART transmit process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMATransmitCplt(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  
  /* DMA Normal mode */
  // debug_putchar('x');
  if ( HAL_IS_BIT_CLR(hdma->Instance->CCR, DMA_CCR_CIRC) ) {  
    /* Disable the DMA transfer for transmit request by resetting the DMAT bit
    in the UART CR3 register */
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_DMAT);
    
    /* Enable the UART Transmit Complete Interrupt */
    SET_BIT(uhandle->Instance->CR1, USART_CR1_TCIE);
  } else {
    /* DMA Circular mode, not implemented */
    Error_Handler(__FILE__, __LINE__);
  }
}

/**
  * @brief DMA UART receive process complete callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMAReceiveCplt(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  /* Get the number of bytes transferred (ideally the requested number of bytes ) */
  uhandle->RxCount = uhandle->RxSize - hdma->Instance->CNDTR;

  /* DMA Normal mode */
  if ( HAL_IS_BIT_CLR(hdma->Instance->CCR, DMA_CCR_CIRC) )
  {
    
    /* Disable PE and ERR (Frame error, noise error, overrun error) interrupts */
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_PEIE);
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_EIE);
    
    /* Disable the DMA transfer for the receiver request by resetting the DMAR bit
       in the UART CR3 register */
    CLEAR_BIT(uhandle->Instance->CR3, USART_CR3_DMAR);

    /* Disable Receiver */
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );    
  }
  
  if (uhandle->OnRx) uhandle->OnRx(uhandle, 0 );
}

/**
  * @brief DMA UART communication error callback.
  * @param hdma DMA handle.
  * @retval None
  */
static void UART_DMAError(DMA_HandleTypeDef *hdma)
{
  UsartHandleT *uhandle = (UsartHandleT *)(hdma->Parent);
  
  /* Stop UART DMA Tx request if ongoing */
  if (HAL_IS_BIT_SET(uhandle->Instance->CR3, USART_CR3_DMAT) ) {
    UsartStopTx(uhandle);
  }
  
  /* Stop UART DMA Rx request if ongoing */
  if ( HAL_IS_BIT_SET(uhandle->Instance->CR3, USART_CR3_DMAR) ) {
    UsartStopRx(uhandle);
  }
  
  if ( uhandle->OnError ) {
    uhandle->last_errors |= HAL_UART_ERROR_DMA;
    uhandle->OnError(uhandle);
  }
}

static void UsartDmaChannelInit(UsartHandleT *uhandle, const HW_DmaType *dma, UsartDmaDirectionEnumType dmadir )
{
  DMA_HandleTypeDef *hdma = dma->dmaHandle;

  hdma->Instance                 = dma->dmaChannel;
  hdma->Parent                   = uhandle;
  hdma->Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma->Init.MemInc              = DMA_MINC_ENABLE;
  hdma->Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma->Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma->Init.Mode                = DMA_NORMAL;
  hdma->Init.Priority            = DMA_PRIORITY_MEDIUM;
  hdma->Init.Request             = dma->dmaRequest;

  switch ( dmadir ) 
  {
    case USART_DMA_RX:
      hdma->Init.Direction = DMA_PERIPH_TO_MEMORY;
      uhandle->hRxDma = dma->dmaHandle;
      break;
    case USART_DMA_TX:
      hdma->Init.Direction = DMA_MEMORY_TO_PERIPH;
      uhandle->hTxDma = dma->dmaHandle;
      break;
    default:
        Error_Handler(__FILE__, __LINE__);
        return;
  }
  
  HAL_DMA_Init(hdma);

  /* 
   * All callbacks have been set to NULL by Init, 
   * now set Callbacks for DMA complete and DMA error 
   */

  switch ( dmadir ) 
  {
    case USART_DMA_RX:
      hdma->XferCpltCallback = UART_DMAReceiveCplt;
      hdma->XferErrorCallback = UART_DMAError;
      break;
    case USART_DMA_TX:
      hdma->XferCpltCallback = UART_DMATransmitCplt;   
      hdma->XferErrorCallback = UART_DMAError;
      break;
    default:
        Error_Handler(__FILE__, __LINE__);
        return;
  }

  return;
}

bool COM_Init(const HW_DeviceType *self)
{
    USART_AdditionalDataType *adt   = USART_GetAdditionalData(self);
    UsartHandleT *myHandle          = adt->myHandle;

    /* Set and enable clock */
    Usart_Clock_Init(self, true);
    
    /* Init GPIO Pins, GPIO Clocks and UART Clock */
    Usart_GPIO_Init(self);

    /* Clear handle */
    memset(myHandle, 0, sizeof(UsartHandleT) );


    /* Assign U(S)ART Instance to handle */
    myHandle->Instance = (USART_TypeDef*)self->devBase; 

    /* Set RX to character mode by default */
    myHandle->bRxCharMode = true;

    /* Set Communication Parameters (baudrate) */
    if ( !Usart_SetCommParams(myHandle, adt->myBaudrate, true) ) return false;

    /* Configure the NVIC, enable interrupts */
    HW_SetAllIRQs(self->devIrqList, true);

    /* Enable DMA, if specified */            
    if ( self->devDmaRx || self->devDmaTx ) {

        HW_SetDmaChClock(self->devDmaTx, self->devDmaRx);
        // Take the first interrupt to copy prio and subprio to dma channel interrupts
        const HW_IrqType *irq = self->devIrqList->irq;

        if ( self->devDmaRx ) {
            UsartDmaChannelInit( myHandle, self->devDmaRx, USART_DMA_RX );
            HAL_NVIC_SetPriority(self->devDmaRx->dmaIrqNum, irq->irq_prio, irq->irq_subprio);
            HAL_NVIC_EnableIRQ(self->devDmaRx->dmaIrqNum);
        }
        if ( self->devDmaTx ) {
            UsartDmaChannelInit( myHandle, self->devDmaTx, USART_DMA_TX );
            HAL_NVIC_SetPriority(self->devDmaTx->dmaIrqNum, irq->irq_prio, irq->irq_subprio);
            HAL_NVIC_EnableIRQ(self->devDmaTx->dmaIrqNum);
        }
    } // if DMA
    return true;
}

