rainer20512/stm32-fw/common/src/dev/usart.c
void COM_DeInit(const HW_DeviceType *self)
{
    HW_Reset( (USART_TypeDef*)self->devBase );

    /* Disable GPIO Pins */
    GpioAFDeInitAll(self->devGpioAF);
    
    /* disable interrupts */
    HW_SetAllIRQs(self->devIrqList, false);

    /* Disable the DMA, if used */
    if(self->devDmaTx) {
      /* De-Initialize the Tx part  */
      HAL_DMA_DeInit(self->devDmaTx->dmaHandle);
      HAL_NVIC_DisableIRQ(self->devDmaTx->dmaIrqNum);
    }
    if(self->devDmaRx) {
      /* De-Initialize the Rx part  */
      HAL_DMA_DeInit(self->devDmaRx->dmaHandle);
      HAL_NVIC_DisableIRQ(self->devDmaRx->dmaIrqNum);
    }

    /* Disable clock */
    Usart_Clock_Init(self, false);
}


/******************************************************************************
 * Check, whether the system may enter Stop 2 mode. 
 * This is the case, if neither transmit is active
 * nor receive in character mode or receiver enabled in block mode
 *****************************************************************************/
bool COM_AllowStop(const HW_DeviceType *self)
{
    UsartHandleT *myHandle  = USART_GetAdditionalData(self)->myHandle;
    USART_TypeDef *u        = (USART_TypeDef*)self->devBase;

    return (u->ISR & USART_ISR_TC ) &&  ( u->CR1 & ( USART_CR1_TXEIE | USART_CR1_TCIE ) )  == 0  && (myHandle->bRxCharMode ? u->ISR & USART_ISR_BUSY : u->CR1 & USART_CR1_RE ) == 0;
}

#if defined(USART1) && defined(USE_USART1)
    UsartHandleT HandleCOM1;

    static const HW_GpioList_AF gpio_com1 = {
        .num = 2,
        .gpio = {COM1_TX, COM1_RX} ,
    };

    static const USART_AdditionalDataType additional_com1 = {
        &HandleCOM1,
        DEBUG_BAUDRATE,
    };
    
    #if defined(COM1_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com1_tx;
        static const HW_DmaType dmatx_com1 = { &hdma_com1_tx, COM1_TX_DMA };
    #endif
    #if defined(COM1_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com1_rx;
        static const HW_DmaType dmarx_com1 = { &hdma_com1_rx, COM1_RX_DMA };
    #endif

    static const HW_IrqList irq_com1 = {
        .num = 1,
        .irq = { COM1_IRQ, },
    };

    const HW_DeviceType HW_COM1 = {
        .devName        = "COM1",
        .devBase        = USART1,
        .devGpioAF        = &gpio_com1,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com1,
        .devIrqList     = &irq_com1,
        #if defined(COM1_USE_TX_DMA)
            .devDmaTx = &dmatx_com1,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM1_USE_RX_DMA)
            .devDmaRx = &dmarx_com1,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

#if defined(USART2) && defined(USE_USART2)
    UsartHandleT HandleCOM2;

    static const HW_GpioList_AF gpio_com2 = {
        .num = 2,
        .gpio = {COM2_TX, COM2_RX} ,
    };

    static const USART_AdditionalDataType additional_com2 = {
        &HandleCOM2,
        DEBUG_BAUDRATE,
    };

    #if defined(COM2_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com2_tx;
        static const HW_DmaType dmatx_com2 = { &hdma_com2_tx, COM2_TX_DMA };
    #endif
    #if defined(COM2_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com2_rx;
        static const HW_DmaType dmarx_com2 = { &hdma_com2_rx, COM2_RX_DMA };
    #endif

    static const HW_IrqList irq_com2 = {
        .num = 1,
        .irq = { COM2_IRQ, },
    };

    const HW_DeviceType HW_COM2 = {
        .devName        = "COM2",
        .devBase        = USART2,
        .devGpioAF        = &gpio_com2,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com2,
        .devIrqList     = &irq_com2,
        #if defined(COM2_USE_TX_DMA)
            .devDmaTx = &dmatx_com2,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM2_USE_RX_DMA)
            .devDmaRx = &dmarx_com2,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(USART3) && defined(USE_USART3)
    UsartHandleT HandleCOM3;

    static const HW_GpioList_AF gpio_com3 = {
        .num = 2,
        .gpio = {COM3_TX, COM3_RX} ,
    };

    static const USART_AdditionalDataType additional_com3 = {
        &HandleCOM3,
        DEBUG_BAUDRATE,
    };

    #if defined(COM3_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com3_tx;
        static const HW_DmaType dmatx_com3 = { &hdma_com3_tx, COM3_TX_DMA };
    #endif
    #if defined(COM3_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com3_rx;
        static const HW_DmaType dmarx_com3 = { &hdma_com3_rx, COM3_RX_DMA };
    #endif

    static const HW_IrqList irq_com3 = {
        .num = 1,
        .irq = { COM3_IRQ, },
    };

    const HW_DeviceType HW_COM3 = {
        .devName        = "COM3",
        .devBase        = USART3,
        .devGpioAF        = &gpio_com3,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com3,
        .devIrqList     = &irq_com3,
        #if defined(COM3_USE_TX_DMA)
            .devDmaTx = &dmatx_com3,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM3_USE_RX_DMA)
            .devDmaRx = &dmarx_com3,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(UART4) && defined(USE_UART4)
    UsartHandleT HandleCOM4;

    static const HW_GpioList_AF gpio_com4 = {
        .num = 2,
        .gpio = {COM4_TX, COM4_RX} ,
    };

    static const USART_AdditionalDataType additional_com4 = {
        &HandleCOM4,
        DEBUG_BAUDRATE,
    };

    #if defined(COM4_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com4_tx;
        static const HW_DmaType dmatx_com4 = { &hdma_com4_tx, COM4_TX_DMA };
    #endif
    #if defined(COM4_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com4_rx;
        static const HW_DmaType dmarx_com4 = { &hdma_com4_rx, COM4_RX_DMA };
    #endif

