rainer20512/stm32-fw/common/src/dev/usart.c
    static const HW_IrqList irq_com4 = {
        .num = 1,
        .irq = { COM4_IRQ, },
    };

    const HW_DeviceType HW_COM4 = {
        .devName        = "COM4",
        .devBase        = UART4,
        .devGpioAF        = &gpio_com4,
        .devGpioIO        = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com4,
        .devIrqList     = &irq_com4,
        #if defined(COM4_USE_TX_DMA)
            .devDmaTx = &dmatx_com4,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM4_USE_RX_DMA)
            .devDmaRx = &dmarx_com4,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(UART5) && defined(USE_UART5)
    UsartHandleT HandleCOM5;

    static const HW_GpioList_AF gpio_com5 = {
        .num = 2,
        .gpio = {COM5_TX, COM5_RX} ,
    };

    static const USART_AdditionalDataType additional_com5 = {
        &HandleCOM5,
        DEBUG_BAUDRATE,
    };

    #if defined(COM5_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com5_tx;
        static const HW_DmaType dmatx_com5 = { &hdma_com5_tx, COM5_TX_DMA };
    #endif
    #if defined(COM5_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com5_rx;
        static const HW_DmaType dmarx_com5 = { &hdma_com5_rx, COM5_RX_DMA };
    #endif

    static const HW_IrqList irq_com5 = {
        .num = 1,
        .irq = { COM5_IRQ, },
    };

    const HW_DeviceType HW_COM5 = {
        .devName        = "COM5",
        .devBase        = UART5,
        .devGpioAF      = &gpio_com5,
        .devGpioIO      = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com5,
        .devIrqList     = &irq_com5,
        #if defined(COM5_USE_TX_DMA)
            .devDmaTx = &dmatx_com5,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM5_USE_RX_DMA)
            .devDmaRx = &dmarx_com5,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif


#if defined(LPUART1) && defined(USE_LPUART1)
    UsartHandleT HandleCOM6;

    static const HW_GpioList_AF gpio_com6 = {
        .num = 2,
        .gpio = {COM6_TX, COM6_RX} ,
    };

    #if defined(COM6_USE_TX_DMA)
        static DMA_HandleTypeDef hdma_com6_tx;
        static const HW_DmaType dmatx_com6 = { &hdma_com6_tx, COM6_TX_DMA };
    #endif
    #if defined(COM6_USE_RX_DMA)
        static DMA_HandleTypeDef hdma_com6_rx;
        static const HW_DmaType dmarx_com6 = { &hdma_com6_rx, COM6_RX_DMA };
    #endif

    static const USART_AdditionalDataType additional_com6 = {
        &HandleCOM6,
        DEBUG_BAUDRATE,
    };

    static const HW_IrqList irq_com6 = {
        .num = 1,
        .irq = { COM6_IRQ, },
    };

    const HW_DeviceType HW_COM6 = {
        .devName        = "COM6",
        .devBase        = LPUART1,
        .devGpioAF      = &gpio_com6,
        .devGpioIO      = NULL,
        .devType        =  HW_DEVICE_UART,
        .devData        = &additional_com6,
        .devIrqList     = &irq_com6,
        #if defined(COM6_USE_TX_DMA)
            .devDmaTx = &dmatx_com6,
        #else
            .devDmaTx = NULL,
        #endif
        #if defined(COM6_USE_RX_DMA)
            .devDmaRx = &dmarx_com6,
        #else
            .devDmaRx = NULL,
        #endif

        .Init           = COM_Init,
        .DeInit         = COM_DeInit,
        .OnFrqChange    = Usart_OnFrqChange,
        .AllowStop      = COM_AllowStop,
        .OnSleep        = NULL,
        .OnWakeUp       = NULL,
    };
#endif

/* ------------------------------------------------------------------------------*/
/* Exported functions -----------------------------------------------------------*/
/* ------------------------------------------------------------------------------*/


void UsartClockInit(void)
{
  RCC_PeriphCLKInitTypeDef PeriphClkInit;

  PeriphClkInit.PeriphClockSelection = 0;
#if defined(USART1) && defined(USE_USART1)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_USART1; 
    PeriphClkInit.Usart1ClockSelection = USART1_CLKSOURCE;
#endif
#if defined(USART2) && defined(USE_USART2)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_USART2; 
    PeriphClkInit.Usart2ClockSelection = USART2_CLKSOURCE;
#endif
#if defined(USART3) && defined(USE_USART3)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_USART3; 
    PeriphClkInit.Usart3ClockSelection = USART3_CLKSOURCE;
#endif
#if defined(UART4) && defined(USE_UART4)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_UART4; 
    PeriphClkInit.Uart4ClockSelection = UART4_CLKSOURCE;
#endif
#if defined(UART5) && defined(USE_UART5)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_UART5; 
    PeriphClkInit.Uart5ClockSelection = UART5_CLKSOURCE;
#endif
#if defined(LPUART1) && defined(USE_LPUART1)
    PeriphClkInit.PeriphClockSelection |= RCC_PERIPHCLK_LPUART1; 
    PeriphClkInit.Lpuart1ClockSelection = LPUART1_CLKSOURCE;
#endif

  if (HAL_RCCEx_PeriphCLKConfig(&PeriphClkInit) != HAL_OK)
  {
    Error_Handler(__FILE__, __LINE__);
  }
}

/******************************************************************************
 * Enable Uart receiver
 * if in char mode, also enable error interrupts, otherwise disable 
 *****************************************************************************/
static void Usart_EnableRx( USART_TypeDef *Instance, bool bCharmode )
{

    /* Enable the UART Receiver */
    SET_BIT(Instance->CR1, USART_CR1_RE);

    /* Enable the UART Receive Interrupt */
    SET_BIT(Instance->CR1, USART_CR1_RXNEIE);

    /* in char mode enable the UART Error Interrupt: (Frame error, noise error, overrun error) */
    if ( bCharmode ) {
        SET_BIT(Instance->CR3, USART_CR3_EIE);
        /* Enable parity error Interrupt */
        SET_BIT(Instance->CR1, USART_CR1_PEIE);
    } else {
        CLEAR_BIT(Instance->CR3, USART_CR3_EIE);
        /* Enable parity error Interrupt */
        CLEAR_BIT(Instance->CR1, USART_CR1_PEIE);
    }
}


