rainer20512/stm32-fw/common/src/dev/usart.c
void Usart_AssignBuffers ( UsartHandleT *uhandle, LinBuffT *rxcharbuf, CircBuffT *xmit) 
{
    assert(uhandle);
    assert(uhandle->Instance);

    uhandle->in  = rxcharbuf;
    uhandle->out = xmit;

    /* If receive buffer is null in character mode, disable receiver, otherwise enable Rx */
    if ( uhandle->bRxCharMode && rxcharbuf == NULL ) {
        uhandle->Instance->CR1 &= ~USART_CR1_RE;
    } else {
        Usart_EnableRx(uhandle->Instance, uhandle->bRxCharMode);
    }
    
    /* If transmit buffer is null, disable transmitter */
    if ( xmit == NULL ) {
        uhandle->Instance->CR1 &= ~USART_CR1_TE;
    }
}

void UsartAssignCallbacks(UsartHandleT *uhandle, UsartCB OnTx, UsartCB OnErr, UsartRCB OnRx)
{
  assert(uhandle);

  uhandle->OnTxComplete = OnTx;
  uhandle->OnError      = OnErr;
  uhandle->OnRx         = OnRx;
}


/**
  * @brief  Handle UART interrupt request.
  * @param  huart UART handle.
  * @retval None
  * @Note   We need no special handling of WUF interrupt, its just used to wakeup from stop
  *         WUF Interrupt bit is cleared by resetting UESM bit
  */
void UsartIRQHandler(UsartHandleT *uhandle)
{
    uint32_t isrflags   = READ_REG(uhandle->Instance->ISR);
    uint32_t cr1its     = READ_REG(uhandle->Instance->CR1);
    uint32_t errorflags;
    uint8_t ch;

    if ( isrflags & USART_ISR_WUF ) uhandle->Instance->ICR = USART_ICR_WUCF;
    
    /* Check for Parity, Frame, Overrun and Noise Error */
    errorflags = isrflags & (uint32_t)(USART_ISR_PE | USART_ISR_FE | USART_ISR_ORE | USART_ISR_NE);
    if (errorflags != RESET) {
        /* Handle error ( whatever that will be and clear all error flags ) */
        SET_BIT(uhandle->Instance->ICR, errorflags);

        /* ignore noise errors furthermore */
        CLEAR_BIT(errorflags, USART_ISR_NE );

        uhandle->last_errors = errorflags;
        if ( errorflags && uhandle->OnError ) uhandle->OnError(uhandle);
    }

    /* Check for Character Reception */
    if(((isrflags & USART_ISR_RXNE) != RESET) && ((cr1its & USART_CR1_RXNEIE) != RESET)) {
        ch = (uint8_t) (READ_REG(uhandle->Instance->RDR) & 0xFF );
        if ( uhandle->bRxCharMode ) {
            assert ( uhandle->in );
            /* Store only, if there were no errors */
            if (errorflags == RESET)  {
                // DEBUG_PUTC('r');DEBUG_PUTC('=');print_hexXX((uint8_t)ch);
                if ( !LinBuff_Putc(uhandle->in, ch ) ) DEBUG_PUTS("Inbuf Overrun");
                /* call Callback, if specified */
                if (uhandle->OnRx) uhandle->OnRx(uhandle, ch );
            }
            return;
        } else {
            assert(uhandle->blockIn);
            /* Rx block mode: Store character and check size*/
            uhandle->blockIn[uhandle->RxCount++] = ch;
            if ( uhandle->RxCount == uhandle->RxSize ) {
                /* If expected length is received, disable receiver and signal via callback */
                CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE);
                if (uhandle->OnRx) uhandle->OnRx(uhandle, 0 );
            }
        }
    } /* if character reception */
  
  /* Check for next Character Transmission */
  if(((isrflags & USART_ISR_TXE) != RESET) && ((cr1its & USART_CR1_TXEIE) != RESET)) {
    /* More Characters to transmit ?*/
    if( uhandle->TxCount < uhandle->TxSize )
    {
      assert(CircBuff_Get_Indexed(uhandle->out, uhandle->TxCount, &ch));
      if ( ch < 0x0a || ch > 0x7f ) {
          ch ='!';
      }
      /* Transmit next character */
      uhandle->Instance->TDR = ch;
      uhandle->TxCount++;
    } else {
      /*
       * No more charcters to transmit: disable the UART Transmit Data Register Empty Interrupt 
       * and enable Transmit Complete interrupt
       */
      CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_TXEIE);
      SET_BIT(uhandle->Instance->CR1, USART_CR1_TCIE);
    }
    
    return;
  }
  
  /* Transmission end */
  if(((isrflags & USART_ISR_TC) != RESET) && ((cr1its & USART_CR1_TCIE) != RESET)) {
    /* Disable the UART Transmit Complete Interrupt */
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_TCIE);
    if ( uhandle->OnTxComplete) uhandle->OnTxComplete(uhandle);
    return;
  }
}

/******************************************************************************
 * Transmit and receive one Byte with active wait/timeout
 * txrx - byte to send / received byte on return
 * tmo  - timeout ( in ms )
 * will return false, if timout occured before reception
 * note: This function reset all interrupt sources 
 *****************************************************************************/
bool UsartTxRxOneByteWait(UsartHandleT *uhandle, uint8_t *txrx, uint32_t tmo) 
{
  uint32_t ticktmo = HAL_GetTick() + tmo;
  USART_TypeDef *u = uhandle->Instance;
  
  assert(u->CR1 & USART_CR1_UE);
  /* Disable all interrupts */
  CLEAR_BIT(u->CR1, USART_CR1_TXEIE | USART_CR1_TCIE | USART_CR1_RXNEIE | USART_CR1_PEIE);
  CLEAR_BIT(u->CR3, USART_CR3_EIE );
  
 
  /* Enable Tx/Rx */
  SET_BIT(u->CR1, USART_CR1_TE | USART_CR1_RE );

  /* Wait for TX empty */
  while ( !READ_BIT(u->ISR, USART_ISR_TXE ) && HAL_GetTick() != ticktmo ) ;
  if ( HAL_GetTick() == ticktmo ) return false;

  /* dummy read to empty receive register */
  (void)u->RDR;   
  u->TDR = *txrx;

  /* Wait for RX not empty or timeout */
  while ( !READ_BIT(u->ISR, USART_ISR_RXNE) && HAL_GetTick() != ticktmo ) ;
  if ( HAL_GetTick() == ticktmo ) {
    DEBUG_PUTS("Unexpected timeout on Tx/Rx byte");
    return false;
  }

  *txrx = u->RDR;

  /* If usart is in blockmode, disable receiver */
  if ( !uhandle->bRxCharMode )  
    CLEAR_BIT(uhandle->Instance->CR1, USART_CR1_RE );    

  return true;
}

void UsartStartTx(UsartHandleT *uhandle, uint8_t *data, uint32_t txSize)
{  
  uhandle->TxSize  = txSize; 
  
  /* If we have an DMA-handle, activate DMA transfer */
  if ( uhandle->hTxDma ) {
    /* Enable the UART transmit DMA channel */
    HAL_DMA_Start_IT(uhandle->hTxDma, (uint32_t)data, (uint32_t)&uhandle->Instance->TDR, txSize);
    
    /* Clear the TC flag in the ICR register */
    uhandle->Instance->ICR = UART_CLEAR_TCF;
    
    /* Assume a successful transmission: all elements transferred, used on completion */
    uhandle->TxCount = uhandle->TxSize;
    /* 
     * Enable the DMA transfer for transmit request by setting the DMAT bit
     * in the UART CR3 register 
     */
    
    SET_BIT(uhandle->Instance->CR3, USART_CR3_DMAT);
  } else {
    
